# -*- coding: utf-8; -*-
#+SETUPFILE: "../include/css-1.org"
#+SETUPFILE: "../include/mathjax.org"
#+TITLE: Orientation correlations among rice grains, part 8: XXX
#+DATE: [2016-03-11 Fri]
#+PROPERTY: header-args:ipython :session :eval no-export :exports both

In the [[file:./20160219-Orientation_correlations_among_rice_grains-07.org][previous instalment]] of this series, we have analyzed the morphology of the rice grains. In particular, we have defined their /orientation/ as that of the major axis of inertia. We are now in a position to quantify the statistics of the orientations. We will first discuss [[#S1][one-point statistics]] (each grain is considered individually), then [[#S2][two-point statistics]] (mutual orientations of pairs of grains are considered). Finally, we will try to quantify how [[#Boundary_effects][the wall of the sample container]] influences the orientation of the rice grains.

* One-point order parameter
  :PROPERTIES:
  :CUSTOM_ID: S1
  :END:

Various order parameters have been introduced in order to identify preferred orientations in assemblies of anisotropic particles. In the present post, we will use the so-called nematic order parameter, which is used to monitor isotropic-nematic phase transitions ([[file:../pages/references.org::#EPPE1984][Eppenga and Frenkel, 1984]])

\begin{equation}
\label{eq:1}
S_1=\mathbb E\left(\frac{3\cos^2\theta-1}2\right)=\frac1N\sum_{i=1}^N\frac{3\cos^2\theta_i-1}2,
\end{equation}

where $\mathbb E$ denotes the ensemble average, and $\theta$ is the angle of the current particle with respect to a fixed direction. In the last equality, the ensemble average was replaced with an empirical average over all particles in the system.

If the distribution of particles is isotropic, then the pdf of the orientations reads (in [[https://en.wikipedia.org/wiki/Spherical_coordinate_system][spherical coordinates]], physics convention)

\begin{equation*}
p(\theta, \varphi)=\frac1{4\pi}\sin\theta\,{\mathrm d}\theta\,{\mathrm d}\varphi,
\end{equation*}

($\theta$: polar angle; $\varphi$: azimuthal angle), and we find

\begin{equation*}
S_1=\frac1{4\pi}\int_{0\leq\theta\leq\pi}\int_{0\leq\varphi\leq2\pi}\frac{3\cos^2\theta-1}2\sin\theta\,{\mathrm d}\theta\,{\mathrm d}\varphi=0.
\end{equation*}

Conversely, for particles with fixed orientation, $\theta=0$ for all particles and $S_1=1$.

Let us compute $S_1$ for the assembly of rice grains. In the [[file:./20160219-Orientation_correlations_among_rice_grains-07.org][last instalment]] of this series, we have computed the orientation (unit vector) of each grain. We first retrieve this data.

#+BEGIN_SRC ipython :results none
  import os.path

  import h5py
  import matplotlib.pyplot as plt
  import numpy as np
  import scipy.ndimage
  import scipy.spatial

  plt.style.use('../include/zenburn-light.mplstyle')

  filename = os.path.join('Z:', 'sebastien', 'experimental_data',
                          'navier', 'riz', 'rice-bin_4x4x4.hdf5')

  with h5py.File(filename, 'r') as f:
      center = np.asarray(f['center_of_mass'])
      orientation = np.asarray(f['orientation'])
#+END_SRC

Now, =center[i, :]= denotes the coordinates of the center of grain =i=, while =orientation[i, :]= denotes the orientation of grain =i=. In what follows, we will compute $S_1$, taking the vertical as reference direction. At this point, it should be recalled that the $z$ coordinate (along the vertical) is the first index in the 3D image (slice number). Therefore, $\cos\theta_i$ is given by =orientation[i, 0]= in this context.

#+BEGIN_SRC ipython :results output
  cos_theta = orientation[:, 0]
  p2_cos_theta = (3*cos_theta**2-1)/2
  print('S1 = {}'.format(p2_cos_theta.mean()))
#+END_SRC

#+RESULTS:
: S1 = -0.09220327774809803

It is observed that $S_1$ is non-zero, which indicates a slight anisotropy. $S_1$ is a one-point descriptor of the microsctructure. In other words, only one particle is considered at a time (orientational correlations are not accounted for). In the next section, we will show how such correlations can be quantified.

